DataProcessors/РабочееМестоМенеджераИМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоМенеджераИМ</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>НоменклатураПоставщиков</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/РабочееМестоМенеджераИМ/Forms/ФормаПросмотраКартинки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	СсылкаНаТовар =  Параметры.ссылкаНаТовар;
	
	Картинка = 
	"<html>
	|<head>
	|</head>
	|<body>
	|<img src = " + Параметры.АдресКартинки + " width=""800px"" 
	|</body>
	|</html>"
	;
	// + 003676 ДДГ 10 ноя 2020
	Элементы.АдресФото.Заголовок = Параметры.АдресКартинки;
	// - 003676 ДДГ 10 ноя 2020
	КоличествоКартинок = Параметры.МассивКартинокСсылки.Количество();
	Если КоличествоКартинок>10 тогда 
		КоличествоКартинок = 10
	КонецЕсли;
	Для Индекс = 1 По КоличествоКартинок Цикл
		
		Попытка
			КартинкаВрем = Параметры.МассивКартинокСсылки.получить(Индекс-1).Значение;
			// + 003676 ДДГ 10 ноя 2020
			//Если ТипЗнч(КартинкаВрем.Объект) = тип("СправочникСсылка.Номенклатура") Тогда
			//	АдресКартинки =ry_ОбщиеПроцедуры.ПеревестиНаТранслит(СтрЗаменить("http://192.168.1.33/"+КартинкаВрем.Объект.Артикул+"_"+КартинкаВрем.Объект.Бренд+"_"+КартинкаВрем.УникальныйИдентификатор+".jpg",Символы.НПП,""));; 	
			//ИначеЕсли ТипЗнч(КартинкаВрем.Объект) = тип("СправочникСсылка.ХарактеристикиНоменклатуры") тогда 
			//	АдресКартинки =ry_ОбщиеПроцедуры.ПеревестиНаТранслит(СтрЗаменить("http://192.168.1.33/"+КартинкаВрем.Объект.Владелец.Артикул+"_"+КартинкаВрем.Объект.Владелец.Бренд+"_"+ПолучитьНомерБУ(КартинкаВрем.Объект)+"_"+КартинкаВрем.УникальныйИдентификатор+".jpg",Символы.НПП,"")); 	
			//КонецЕсли;
			АдресКартинки = ПоместитьВоВременноеХранилище(КартинкаВрем.Хранилище.Получить(), Новый УникальныйИдентификатор);
			// - 003676 ДДГ 10 ноя 2020
		Исключение
		КонецПопытки;

		Попытка
			ЭтаФорма["Картинка"+Индекс] = 
			"<html>
			|<head>
			|</head>
			|<body>
			|<img src = " + АдресКартинки + " width=""150px""
			|</body>
			|</html>";
			ЭтаФорма.Элементы["Картинка"+Индекс].Видимость = истина;
			МассивКартинок.Добавить(АдресКартинки); 
			
		Исключение
			// + 003676 ДДГ 10 ноя 2020
			//ЭтаФорма["Картинка"+Индекс] = 
			//"<html>
			//|<head>
			//|</head>
			//|<body>
			//|<img src = " + ?(ТипЗнч(Параметры.МассивКартинок[Индекс-1].Значение) = Тип("СправочникСсылка.ХранилищеДополнительнойИнформации"),ПоместитьВоВременноеХранилище(Параметры.МассивКартинок[Индекс-1].Значение.Хранилище.Получить()),Параметры.МассивКартинок[Индекс-1].Значение) + " width=""150px""
			//|</body>
			//|</html>";
			//ЭтаФорма.Элементы["Картинка"+Индекс].Видимость = истина;
			//МассивКартинок.Добавить(?(ТипЗнч(Параметры.МассивКартинок[Индекс-1].Значение) = Тип("СправочникСсылка.ХранилищеДополнительнойИнформации"),ПоместитьВоВременноеХранилище(Параметры.МассивКартинок[Индекс-1].Значение.Хранилище.Получить()),Параметры.МассивКартинок[Индекс-1].Значение)); 
			// - 003676 ДДГ 10 ноя 2020
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьНомерБУ(Характеристиика)
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Значение
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |		ПО ХарактеристикиНоменклатуры.Ссылка = ЗначенияСвойствОбъектов.Объект
	               |			И (ХарактеристикиНоменклатуры.Ссылка = &Характеристика)
	               |			И (ЗначенияСвойствОбъектов.Свойство = &Свойство)
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Ссылка = &Характеристика";
	Запрос.УстановитьПараметр("Характеристика",Характеристиика);
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("7.Номер детали"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат СтрЗаменить(СтрЗаменить(РезультатЗапроса[0].Значение,Символы.НПП,"")," ","");
	иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура Картинка1ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	КартинкаПриНажатииНаСервере(1);

КонецПроцедуры


&НаКлиенте
Процедура Картинка2ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КартинкаПриНажатииНаСервере(2);
КонецПроцедуры


&НаКлиенте
Процедура Картинка3ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
КартинкаПриНажатииНаСервере(3);	
КонецПроцедуры


&НаКлиенте
Процедура Картинка4ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
КартинкаПриНажатииНаСервере(4);
КонецПроцедуры


&НаКлиенте
Процедура Картинка5ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
КартинкаПриНажатииНаСервере(5);	
КонецПроцедуры

&НаСервере
Процедура КартинкаПриНажатииНаСервере(инд)
		Картинка = 
		"<html>
		|<head>
		|</head>
		|<body>
		|<img src = " + МассивКартинок.получить(Инд-1) + " width=""800px"" 
		|</body>
		|</html>"
		;
		// + 003676 ДДГ 10 ноя 2020
		Элементы.АдресФото.Заголовок = МассивКартинок.получить(Инд-1);
		// - 003676 ДДГ 10 ноя 2020
КонецПроцедуры


&НаКлиенте
Процедура Картинка6ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КартинкаПриНажатииНаСервере(6);	
КонецПроцедуры


&НаКлиенте
Процедура Картинка7ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КартинкаПриНажатииНаСервере(7);	
КонецПроцедуры


&НаКлиенте
Процедура Картинка8ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КартинкаПриНажатииНаСервере(8);	
КонецПроцедуры


&НаКлиенте
Процедура Картинка9ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	КартинкаПриНажатииНаСервере(9);	
КонецПроцедуры


&НаКлиенте
Процедура Картинка11ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура Картинка10ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура АдресФотоОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	 Элементы.Добавить(Тип("ПолеHTMLДокумента"), "Поле_HTML_Документа_acb123", Ложь); 
      

     Окно = Элементы.Поле_HTML_Документа_acb123.Документ.ParentWindow; 
      

     Окно.ClipboardData.SetData("Text", Элементы.АдресФото.Заголовок); 
      

     Элементы.Удалить(Элементы.Индекс(Элементы.Найти("Поле_HTML_Документа_acb123"))); 
КонецПроцедуры


&НаКлиенте
Процедура АдресФотоНажатие(Элемент)
	

	 
 #Если Клиент Тогда
    Если (ТипЗнч(Элементы.АдресФото.Заголовок) = Тип("Строка")) И (СокрЛП(Элементы.АдресФото.Заголовок) <> "") Тогда
      Об = Новый COMОбъект("htmlfile");
      Об.ParentWindow.ClipboardData.Setdata("Text", Элементы.АдресФото.Заголовок);
  КонецЕсли;
  
  ПоказатьОповещениеПользователя("Буфер обмена",,"Строка скопирована в буфер обмена");
  #КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФото(Команда)
	
	СтруктураДляСпискаИзображдений = Новый Структура("ОтборОбъектИспользование, ОтборОбъектЗначение, ДоступностьОтбораОбъекта, ВидимостьКолонкиОбъекта", Истина, СсылкаНаТовар, Ложь, Ложь);
	СтруктураДляСпискаДополнительныхФайлов = Новый Структура("ОтборОбъектИспользование, ОтборОбъектЗначение, ДоступностьОтбораОбъекта, ВидимостьКолонкиОбъекта", Истина, СсылкаНаТовар, Ложь, Ложь);
	ОбязательныеОтборы = Новый Структура("Объект", СсылкаНаТовар);
	
	РаботаСФайлами.ОткрытьФормуСпискаФайловИИзображений(СтруктураДляСпискаИзображдений, СтруктураДляСпискаДополнительныхФайлов, ОбязательныеОтборы, ЭтаФорма);

КонецПроцедуры
